run/rectangularCavityPar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


4
(
frontAndBack
{
    type            empty;
    nFaces          9702;
    startFace       9554;
}

topAndBottom
{
    type            patch;
    nFaces          198;
    startFace       19256;
}

outlet
{
    type            patch;
    nFaces          49;
    startFace       19454;
}

inlet
{
    type            patch;
    nFaces          49;
    startFace       19503;
}

)


// ************************************************************************* //
