run/rectangularCavityPar/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 5;

boundaryField
{

    frontAndBack
    {
        type            empty;
      
    }

    inlet
    {
        type            fixedValue;
        value           uniform 5;
    }

    outlet
    {
        type            zeroGradient;

    }

    topAndBottom
    {
        type            slip;
    }


    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
